
PERK_THEMED_NAMES = {
            'Супер-Удой': {
                'female': ['Молочница', 'Удойная', 'Продуктивная', 'Щедрая'],
                'male': ['Породистый', 'Элитный', 'Отборный']
            },
            'Быстрый рост': {
                'female': ['Скороспелка', 'Быстрая', 'Шустрая', 'Резвая'],
                'male': ['Скороспелый', 'Шустрый', 'Молодой', 'Резвый']
            },
            'Эффективное питание': {
                'female': ['Экономка', 'Скромница', 'Умница', 'Бережливая'],
                'male': ['Экономный', 'Умный', 'Рачительный']
            },
            'Двойняшки': {
                'female': ['Многодетная', 'Плодовитая', 'Мамочка', 'Родительница'],
                'male': ['Плодовитый', 'Отец-Молодец', 'Производитель']
            },
            'Крепкое здоровье': {
                'female': ['Здоровяшка', 'Крепышка', 'Сильная', 'Стойкая'],
                'male': ['Здоровяк', 'Крепыш', 'Стойкий', 'Могучий']
            }
        }