
PERK_THEMED_NAMES = {
            'Супер-Удой': {
                'female': ['Молочница', 'Удойная', 'Продуктивная', 'Щедрая'],
                'male': ['Породистый', 'Элитный', 'Отборный']
            },
            'Быстрый рост': {
                'female': ['Скороспелка', 'Быстрая', 'Шустрая', 'Резвая'],
                'male': ['Скороспелый', 'Шустрый', 'Молодой', 'Резвый']
            },
            'Эффективное питание': {
                'female': ['Экономка', 'Скромница', 'Умница', 'Бережливая'],
                'male': ['Экономный', 'Умный', 'Рачительный']
            },
            'Двойняшки': {
                'female': ['Многодетная', 'Плодовитая', 'Мамочка', 'Родительница'],
                'male': ['Плодовитый', 'Отец-Молодец', 'Производитель']
            },
            'Крепкое здоровье': {
                'female': ['Здоровяшка', 'Крепышка', 'Сильная', 'Стойкая'],
                'male': ['Здоровяк', 'Крепыш', 'Стойкий', 'Могучий']
            }
        }

FEMALE_PREFIXES = [
                'Буре', 'Зоре', 'Мила', 'Краса', 'Ряба', 
                'Белла', 'Дуня', 'Маня', 'Зорька', 'Пеструш',
                'Ночка', 'Звёзд', 'Росин', 'Милаш', 'Добрын'
            ]
FEMALE_SUFFIXES = [
                'нка', 'ша', 'ка', 'вушка', 'чка',
                'юшка', 'лька', 'енька', 'очка'
            ]
FEMALE_FULLNAMES = [
                    'Буренка', 'Зорька', 'Майка', 'Милка', 'Рыжуха',
                    'Белянка', 'Пеструшка', 'Ночка', 'Звездочка', 'Ромашка',
                    'Кнопка', 'Дуняша', 'Маняша', 'Красотка', 'Ласточка'
                ]

MALE_PREFIXES = [
                'Бор', 'Гром', 'Мощ', 'Силач', 'Буян',
                'Грозд', 'Рог', 'Крут', 'Могуч', 'Богатыр',
                'Молод', 'Удал', 'Яр'
            ]
MALE_SUFFIXES = [
                'яка', 'ище', 'ан', 'ай', 'ок',
                'ило', 'ец', 'юн'
            ]
MALE_FULLNAMES = [
                    'Борька', 'Громобой', 'Рогач', 'Буян', 'Силач',
                    'Могучий', 'Богатырь', 'Гром', 'Молодец', 'Добрыня',
                    'Бычок', 'Крутой', 'Яростный'
                ]